import pygame
from enum import Enum

pygame.init()
pygame.font.init()

SCREEN_WIDTH = 1280
SCREEN_HEIGHT = 720
FPS = 60

COLORS = {
    'background': (255, 232, 217),
    'dark_brown': (42, 26, 14),
    'brown': (78, 36, 4),
    'light_brown': (153, 88, 42),
    'beige': (254, 250, 224),
    'dark_beige': (211, 190, 160),
    'button_brown': (170, 122, 101),
    'white': (255, 255, 255),
    'black': (28, 28, 28),
    'red': (147, 41, 41),
    'green': (60, 120, 60),
}

class Season(Enum):
    WINTER = "Зима"
    SPRING = "Весна"
    SUMMER = "Лето"
    AUTUMN = "Осень"

class CardType(Enum):
    PRODUCT = "product"
    EVENT = "event"
    NEGATIVE = "negative"

class CardState(Enum):
    BACK = 1
    REVEALED = 2
    INVENTORY = 3

class Window(Enum):
    MENU = 1
    LEVELS = 2
    RULES = 3
    MAIN = 4
    EVENTS = 5
    GAME_OVER = 6
    SELL_REGIONS = 7
    RECIPIENT = 8
    PAUSE = 9

PRODUCTS = {
    "Пшеница": {"buy": 8, "sell": 5, "season_effects": {"Лето": 90, "Зима": 80}, "desc": "Самая распространенная культура в королевстве!"},
    "Рыба": {"buy": 12, "sell": 8, "season_effects": {"Осень": 40, "Весна": 70}, "desc": "Рыболовный промысел во все времена кормил жителей юга!"},
    "Уголь": {"buy": 10, "sell": 6, "season_effects": {"Зима": 150, "Лето": -30}, "desc": "Лучший источник тепла и энергии!"},
    "Шерсть": {"buy": 15, "sell": 10, "season_effects": {"Зима": 140, "Весна": -10}, "desc": "Теплое шерстяное одеяло сможет согреть даже самой суровой зимой!"},
    "Железо": {"buy": 20, "sell": 14, "season_effects": {"Осень": 50, "Лето": -10}, "desc": "Основа прогресса, найдет свое место во всех уголках страны!"},
    "Вино": {"buy": 25, "sell": 18, "season_effects": {"Осень": 50, "Зима": 70}, "desc": "Никто не откажется от бокала вина на праздничном столе!"},
    "Лекарства": {"buy": 30, "sell": 22, "season_effects": {"Весна": 40, "Зима": 140}, "desc": "Крайне редки и сложны в изготовлении!"},
    "Меха": {"buy": 35, "sell": 25, "season_effects": {"Зима": 160, "Лето": -50}, "desc": "Ни одна зима на севере не обходится без теплой меховой одежды!"},
    "Специи": {"buy": 40, "sell": 30, "season_effects": {"Осень": 50, "Зима": 70}, "desc": "Вкусная еда требует много разных специй!"},
    "Драгоценные камни": {"buy": 80, "sell": 60, "season_effects": {}, "desc": "Символ богатства и высокого статуса!"}
}

EVENTS = {
    "Война": {"duration": 8, "effects": {"Уголь": 200, "Железо": 200, "Шерсть": 200, "Вино": -20, "Лекарства": 300, "Меха": 140, "Специи": -20, "Драгоценные камни": -30}, "risk_mod": 20, "desc": "На границе страны вспыхнула война!"},
    "Эпидемия": {"duration": 10, "effects": {"Лекарства": 550, "Рыба": 50}, "risk_mod": 30, "desc": "Чума бушует на улицах королевства, будьте осторожны!"},
    "Сухой закон": {"duration": 7, "effects": {"Вино": -40}, "risk_mod": 0, "desc": "Король изъявил сегодня же запретить вино во всей стране!"},
    "Праздник": {"duration": 4, "effects": {"Драгоценные камни": 300, "Специи": 300, "Вино": 300}, "risk_mod": 0, "desc": "Возрадуйтесь, сегодня праздник!"},
    "Шахтёрская забастовка": {"duration": 4, "effects": {"Уголь": 300, "Железо": 320}, "risk_mod": 0, "desc": "Низкие потолки в шахтах и плохой воздух вынудили рабочих взбунтоваться!"}
}

NEGATIVE_EVENTS = {
    "Разбойники": {"desc": "В этот раз покупатели не дождутся своих товаров!", "duration": 1},
    "Неудачное вложение": {"desc": "В следующий раз стоит аккуратнее вкладывать своё золото!", "duration": 1}
}

REGIONS = {
    "Горный": {"effects": {"Пшеница": 50, "Рыба": 50, "Уголь": -20, "Железо": -10, "Вино": 50, "Лекарства": 70, "Специи": 90, "Драгоценные камни": -10}},
    "Приморье": {"effects": {"Пшеница": 30, "Рыба": -10, "Уголь": 50, "Железо": 50, "Вино": -10, "Специи": 40, "Драгоценные камни": 60}},
    "Тайга": {"effects": {"Пшеница": 40, "Уголь": 60, "Железо": 40, "Вино": 50, "Лекарства": -10, "Специи": 50, "Драгоценные камни": -10}},
    "Степь": {"effects": {}}
}

CARD_POSITIONS = [(65, 177), (372, 177), (683, 177), (986, 177)]
CARD_POSITIONS_OFFSCREEN_LEFT = [(-245, 177), (-245, 177), (-245, 177), (-245, 177)]
CARD_POSITIONS_OFFSCREEN_RIGHT = [(SCREEN_WIDTH + 245, 177), (SCREEN_WIDTH + 245, 177), (SCREEN_WIDTH + 245, 177), (SCREEN_WIDTH + 245, 177)]